import { Component, signal } from '@angular/core';
import { FormsModule } from '@angular/forms';   // <-- you MUST import this to use ngModel


@Component({
  selector: 'app-calculate',
  imports: [FormsModule],
  templateUrl: './calculate.html',
  styleUrl: './calculate.css'
})
export class Calculate {
  rates = ['6', '6.1','6.2','6.3','6.4','6.5','6.6']
  price = "";     
  selectedRate = "6";
  notify = "";
  resultText = "";
  cal(){
    const p  = parseFloat(this.price);
    const r = parseFloat(this.selectedRate);
    const result= (p / r).toFixed(2);
    if (!isNaN(p) && !isNaN(r)) { 
      this.notify =`${p} / ${r} = ${result}`
      this.resultText = `សួស្តីបង សរុបហាងទំនិញទាំងអស់ $ ${result}

📌 ចំពោះការទិញទំនិញក្នុងហាងតែមួយ បើហាងបំបែកជាច្រើនកញ្ចប់ នឹងគិតថ្លៃដឹកតាមចំនួនកញ្ចប់។ កញ្ចប់ក្រោម 1 គីឡូ គិតជា1គីឡូ។ លើស 1 គីឡូ នឹងយកទំហំនិងទំងន់ប្រៀបធៀបគ្នា ដើម្បីគិតថ្លៃដឹក។
📌ចំពោះការបញ្ជាទិញនៅក្នុងតេលេក្រាមឆាត ហ្វេសបុកឆាតគឺំពុំមានការបង្រួមកញ្ចប់ទំនិញចូលគ្នាទេ
📌 ខាងប្អូនធានាតែចំពោះការបាត់បង់ឥវ៉ាន់ ប៉ុន្តែមិនអាចធានាលើទំនិញបែកបាក់ គុណភាព ឬទំនិញដែលខាងហាងដាក់ខុសពីការបញ្ជាទិញទេ។ ទោះជាយ៉ាងណា ខាងប្អូននឹងព្យាយាមទាក់ទងទាមទារដំណោះស្រាយពីហាងជំនួសឱ្យបង ប៉ុន្តែដំណោះស្រាយគឺអាស្រ័យលើគោលការណ៍របស់ខាងហាងបានផ្តល់ជូន។
សូមអរគុណសម្រាប់ការយល់ព្រម និងការគាំទ្ររបស់បង! 🙏
`;
    }
    else{this.resultText = `ទិន្នន័យបញ្ចូលមិនគ្រប់គ្រាន់សូមបញ្ចូលម្តងទៀត`}
  }
  price1 = "";
  convertPrice = "";
  correctPrice = "";
  cal1(){
    const rate1 = 6.1;

  }
  

  //copyfucntion
  copyResult = "";
copyById(id: string) {
  const element = document.getElementById(id);

  if (!element) {
    console.error(`Element with ID "${id}" not found.`);
    return;
  }

  const text = element.textContent || "";

  navigator.clipboard.writeText(text)
    .then(() => {
      this.copyResult = "ទិន្នន័យត្រូវបានចម្លង";  // show success message
      console.log("Copied:", text);

      // Remove message after 2 seconds
      setTimeout(() => {
        this.copyResult = "";
      }, 2000);
    })
    .catch(err => {
      console.error("Copy failed", err);
    });
}


}